tap "cirruslabs/cli"
tap "gromgit/fuse" if OS.mac?
tap "helmwave/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Command-line DNS Client for Humans
brew "doggo"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Simple vaultless password manager in Go
brew "gokey"
# Command-line hex viewer
brew "hexyl"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# Automate cluster operations on all your environments
brew "kubeone"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Linux virtual machines
brew "lima" if OS.mac?
# Mac App Store command-line interface
brew "mas" if OS.mac?
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Automated testing for Ansible roles
brew "molecule"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# SQL query tool to analyze data from different file formats and databases
brew "octosql"
# Tools and libraries for smart cards
brew "opensc" unless OS.mac?
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: :changed
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach" if OS.mac?
# Provides an easy way to use U2F-compliant authenticators with PAM
brew "pam-u2f"
# Tool for managing OCI containers and pods
brew "podman"
# Podman Terminal User Interface
brew "podman-tui"
# Monitor data's progress through a pipe
brew "pv"
# Run a command when files change
brew "reflex"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Tool for shell commands execution, visualization and alerting
brew "sampler"
# SOcket CAT: netcat on steroids
brew "socat"
# Non-interactive SSH password auth
brew "sshpass"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# Command-line packet analyzer
brew "tcpdump"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport" unless OS.mac?
# User interface to the TELNET protocol
brew "telnet"
# Go app which generates a dynamic Ansible inventory from a Terraform state file
brew "terraform-inventory"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Consistent delivery tool for Kubernetes
brew "werf"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# UNIX shell (command interpreter)
brew "zsh"
# Orchestrator for running Tart Virtual Machines on a cluster of Apple Silicon devices
brew "cirruslabs/cli/orchard" if OS.mac? && Hardware::CPU.arm?
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart" if OS.mac? && Hardware::CPU.arm?
# Read-only implementation of ext4 for FUSE
brew "gromgit/fuse/ext4fuse-mac" if OS.mac?
# Simple MTP fuse filesystem driver
brew "gromgit/fuse/simple-mtpfs-mac" if OS.mac?
# FUSE filesystem to mount squashfs archives
brew "gromgit/fuse/squashfuse-mac" if OS.mac?
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac" if OS.mac?
# Helmwave is true release management for helm
brew "helmwave/tap/helmwave"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Remotely access another computer through the Google Chrome browser
cask "chrome-remote-desktop-host"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Free and open-source painting and sketching program
cask "krita"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Penetration testing framework
cask "metasploit"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Cloud storage client
cask "onedrive"
# Smart card libraries and utilities
cask "opensc"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Client for Proton Drive
cask "proton-drive"
# Desktop client for Proton Pass
cask "proton-pass"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Companion app for Flipper Zero devices
cask "qflipper"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System calls and log messages analyzer
cask "stratoshark"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Developer-friendly browser for cloud infrastructure
cask "teleport-connect"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Configurator of compatible keyboards in real time
cask "vial"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# A GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# All-in-one office suite
cask "wpsoffice"
# CLI for Yandex Cloud
cask "yandex-cloud-cli"
# Cloud storage
cask "yandex-disk"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
