tap "cirruslabs/cli"
tap "go-task/tap"
tap "goodwithtech/r"
tap "gromgit/fuse" if OS.mac?
tap "hashicorp/tap"
tap "helmwave/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "wez/wezterm"
# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Test your configuration files using Open Policy Agent
brew "conftest"
# Top-like interface for container metrics
brew "ctop"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# GNU compiler collection
brew "gcc" unless OS.mac?
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU C Library
brew "glibc" unless OS.mac?
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Command-line hex viewer
brew "hexyl"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Static analysis tool for Kubernetes YAML files and Helm charts
brew "kube-linter"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Linux virtual machines
brew "lima"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Automated testing for Ansible roles
brew "molecule"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# SQL query tool to analyze data from different file formats and databases
brew "octosql"
# Open source, general-purpose policy engine
brew "opa"
# Tools and libraries for smart cards
brew "opensc" unless OS.mac?
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach" if OS.mac?
# Provides an easy way to use U2F-compliant authenticators with PAM
brew "pam-u2f"
# Tool for managing OCI containers and pods
brew "podman"
# Podman Terminal User Interface
brew "podman-tui"
# Monitor data's progress through a pipe
brew "pv"
# Run a command when files change
brew "reflex"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Non-interactive SSH password auth
brew "sshpass"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: true
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Go app which generates a dynamic Ansible inventory from a Terraform state file
brew "terraform-inventory"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Consistent delivery tool for Kubernetes
brew "werf"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# UNIX shell (command interpreter)
brew "zsh"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart" if OS.mac? && Hardware::CPU.arm?
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Simple security auditing, helping build the Best Docker Images
brew "goodwithtech/r/dockle"
# Simple MTP fuse filesystem driver
brew "gromgit/fuse/simple-mtpfs-mac" if OS.mac?
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac" if OS.mac?
# Consul
brew "hashicorp/tap/consul"
# Nomad
brew "hashicorp/tap/nomad"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Waypoint
brew "hashicorp/tap/waypoint"
# True release manager for Kubernetes
brew "helmwave/tap/helmwave"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Remotely access another computer through the Google Chrome browser
cask "chrome-remote-desktop-host"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualiser
cask "keycastr"
# Free and open-source painting and sketching program
cask "krita"
# Support for Logitech G gear
cask "logitech-g-hub"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Penetration testing framework
cask "metasploit"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Smart card libraries and utilities
cask "opensc"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Cross-platform content manager assistant for the PS Vita
cask "qcma"
# Companion app for Flipper Zero devices
cask "qflipper"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Quicklook extension for source files
cask "syntax-highlight"
# Spreadsheet style tag editor for audio files
cask "tageditor"
# Messaging app with a focus on speed and security
cask "telegram"
# Developer-friendly browser for cloud infrastructure
cask "teleport-connect"
# Unpacks archive files
cask "the-unarchiver"
# Keyboard configurator
cask "via"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# All-in-one office suite
cask "wpsoffice"
# CLI for Yandex Cloud
cask "yandex-cloud-cli"
# Cloud storage
cask "yandex-disk"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
