tap "go-task/tap"
tap "goodwithtech/r"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "helmwave/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/horcrux"
tap "mutagen-io/mutagen"
tap "sunscan/repo"
tap "wez/wezterm"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Test your configuration files using Open Policy Agent
brew "conftest"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Static analysis tool for Kubernetes YAML files and Helm charts
brew "kube-linter"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Package manager for the Lua programming language
brew "luarocks"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Automated testing for Ansible roles
brew "molecule"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# SQL query tool to analyze data from different file formats and databases
brew "octosql"
# Open source, general-purpose policy engine
brew "opa"
# Tools and libraries for smart cards
brew "opensc"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python package management tool
brew "poetry"
# Monitor data's progress through a pipe
brew "pv"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform State → Ansible Dynamic Inventory
brew "terraform-inventory"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Consistent delivery tool for Kubernetes
brew "werf"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Simple security auditing, helping build the Best Docker Images
brew "goodwithtech/r/dockle"
# Simple MTP fuse filesystem driver
brew "gromgit/fuse/simple-mtpfs-mac"
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac"
# HelmWave is like docker-compose for helm
brew "helmwave/tap/helmwave"
# A program for splitting your files into encrypted fragments
brew "jesseduffield/horcrux/horcrux"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Non-interactive ssh password auth
brew "sunscan/repo/sshpass"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# iPhone management application
cask "imazing"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualizer
cask "keycastr"
# File system integration
cask "macfuse"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Quicklook extension for source files
cask "syntax-highlight"
# Spreadsheet style tag editor for audio files
cask "tageditor"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Development environment
cask "vagrant"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Cloud storage
cask "yandex-disk"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
